app/views/tweets/user.html.erb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 4]]
---
						                <p class="heading">Tweets</p>
						                <p class="title is-6"><%= @user.tweets.count %></p>