app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" ORDER BY created_at DESC
---
  def index
    @tweets = Tweet.all.order("created_at DESC")

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "username"], ["LIMIT", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
  def user
    @user = User.find_by_username(params[:username])
    id = @user.id
    @tweets = Tweet.where(user_id: id)

SELECT "users".* FROM "users"
---
  def search
    @user = User.search(params[:search])

INSERT INTO "tweets" ("tweet", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tweet", "this is the tima\r\n"], ["created_at", "2019-11-16 22:23:32.830776"], ["updated_at", "2019-11-16 22:23:32.830776"], ["user_id", 4]]
---
  def create
    @tweet = current_user.tweets.build(tweet_params)

    respond_to do |format|
      if @tweet.save

UPDATE "tweets" SET "tweet" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["tweet", "your ass belongs to me now..."], ["updated_at", "2019-11-16 02:11:16.746121"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @tweet.update(tweet_params)